[{
    "sectionName": "Introduction",
    "slides": [{
        "slideType": "textImage",
        "text": "On May 3, 2017, you may have received an email from a friend that said \"[friend’s name] has shared a document on Google Docs with you.\" Inside, you would have seen an email like the one on the right. It looks legitimate! It even includes the blue button used across multiple Google apps.",
        "imgSrc": "img/module-img/google-docs-screenshot.jpg",
        "imgCitation": "https://twitter.com/zeynep/status/859840026082988038"
    }, {
        "slideType": "textImage",
        "text": "Perhaps you clicked the \"Open in Docs\" button. If you did, you were brought to this Google authentication page.",
        "imgSrc": "img/module-img/google-docs-hack.gif",
        "imgCitation": "https://twitter.com/zachlatta/status/859843151757955072/"
    },{
        "slideType": "quiz",
        "name": "docs-hack",
        "text": "Should you authenticate this \"Google Docs\" application?",
        "imgSrc": "img/module-img/google-docs-hack.gif",
        "imgCitation": "https://twitter.com/zachlatta/status/859843151757955072/",
        "options": [{
            "text": "Yes",
            "correct": false,
            "feedback": "You and 1 million other Google users fell for this sophisticated phishing attack, which granted this adversary the ability to not only further disseminate this dangerous email to more users, but to send other emails from your Gmail account in your name."
        }, {
            "text": "No",
            "correct": true,
            "feedback": "You evaded this phishing attack! If you had fallen for it, this adversary would have gained access to your Gmail account, giving them the ability to disseminate this dangerous email further! Although this may seem sophisticated, there are even more complex phishing attacks out there."
        }]
    }, {
        "slideType": "text",
        "text": "This module will help you detect phishing attacks and defend yourself against digital snoops. <u><a href=\"https://www.verizon.com/about/news/verizons-2016-data-breach-investigations-report-finds-cybercriminals-are-exploiting-human\">Ninety percent of data breaches start with phishing attacks</a></u>, so it is important to protect yourself online."
    }, {
        "slideType": "text",
        "text": "<h3>This module is divided into three sections.</h3><br /><p><b>First</b>, you’ll learn about subtle typos and errors in emails that can indicate the presence of phishing.</p><p><b>Second</b>, you will learn how to scrutinize links in suspicious emails. Phishing attacks are often excellent at making dangerous websites look trustworthy.</p><p><b>Finally</b>, we will show you how your browswer URL bar can help you differentiate between websites that look legitimate and websites that are legitimate. For instance, it can help you identify fraudulent websites pretending to be the websites of banks, hospitals, and other organizations that you would otherwise trust with your personal information.</p>"
    }, {
        "slideType": "text",
        "text": "Each section will introduce you to crucial web security skills and will include interactive tests that will guage your ability to identify phishing content. At the end of this module, you will have the opportunity to play a political operative in a simulation of a high-stakes Presidential election that is marked by increased hacking attempts on campaigns."
    }]
}, {
    "sectionName": "Taking Typos and Names",
    "slides": [{
        "slideType": "text",
        "text": "Phishing emails, though increasingly convincing, can still contain red flags in their bodies and email headers. Some of these flags are clear whereas others are extremely subtle. We will start by examining more recognizable issues in phishing emails before moving onto more inconspicuous ones."
    }, {
        "slideType": "sketchyEmail",
        "name": "bizarre-bccs-and-ccs",
        "title": "Bizarre BCCs and CCs",
        "text": "Let’s start out with an example already familiar to us--the massive Google Doc phish in May 2017. <br><br><b>If you trust the link to this document, click the \"Open in Google Docs\" button. Otherwise delete the email.</b>",
        "emailData": {
            "subject": "Sasha Perigo has shared a document on Google Docs with you",
            "from": "<b>Sasha Perigo</b> &lt;sperigo@stanford.edu&gt;",
            "to": "hhhhhhhhhhhhhh@mailinator.com, bcc: USERNAME_HERE",
            "text": "Sasha Perigo has invited you to view the following document:"
        },
        "options": [{
            "text": "Delete",
            "correct": true,
            "header": "Good job!",
            "feedback": "Congratulations! You successfully avoided this phishing attack."
        }, {
            "text": "Open in Google Docs",
            "correct": false,
            "header": "Uh oh!",
            "feedback": "You fell for an email with a suspicious bcc/cc field, suggesting foul play. Did you notice the cc: to hhhhhhhhhhh@malinator.com? Bizarre CCs like this may be used for analytics of a phishing attack--this address received an email every time the Google Doc phish was propagated."
        }]
    }, {
        "slideType": "text",
        "title": "Have you <i>actually</i> looked at who an email came from?",
        "text": "<p>It is also easy to fall prey to phishing attempts that spoof an email address. In a simulation in a political science class at Stanford this year, students were assigned to teams representing countries and used emails like <span style=\"font-family: Consolas, monaco, monospace;\">&lt;head.of.philipines@gmail.com&gt;</span> to represent their mock heads of state.</p><p>The winning team actually won the simulation by creating fake email accounts to impersonate other heads of state and tricking participants into sharing confidential information with them!</p>"
    }, {
        "slideType": "sketchyEmail",
        "name": "head-of-russia",
        "text": "<p>Let's do a mini-quiz based on this simulation. Assume that all correctly-spelled email accounts are legitimate, and that emails from head of state are of the format <span style=\"font-family: Consolas, monaco, monospace;\">&lt;head.of.[country_name]@gmail.com&gt;</span>.<p>You're representing Russia at this conference as part of its delegation. You get this email. Do you trust it and respond to it?</p><b>If you trust it, click \"Reply\". Otherwise click the delete email button to safely delete the email.</b>",
        "emailData": {
            "subject": "Urgent Message from Head of State",
            "from": "<b>Head of Russian Federation</b> &lt;head.of.russianfederation@gmail.com&gt;",
            "to": "Delegation of Russian Federation",
            "text": "Please send me an overview of all of your delegations members' intentions today, ASAP. We need to sync on strategies. Please also inform me of politically sensitive actions you are considering."
        },
        "options": [{
            "text": "Delete",
            "correct": false,
            "header": "Uh oh! You just deleted an email from your head of state...",
            "feedback": "It's important to be cautious of sending any sensitive information over email, and this caution can include scrutinizing email addresses that have contacted you. Everything in this email address was spelled correctly and should be responded to, but it never hurts to exercise caution and request additional proof of identity from a person online."
        }, {
            "text": "Reply",
            "correct": true,
            "header": "Great!",
            "feedback": "Everything is spelled correctly in this email address, suggesting that this is an email from a legitimate source."
        }]
    }, {
        "slideType": "sketchyEmail",
        "name": "head-of-philippines",
        "text": "Now you’re part of a Southeast Asian delegation. Do you respond to head.of.phillippines@gmail.com? <br /><br /><b>If you trust it, click \"Reply\". Otherwise click the delete email button to safely delete the email.</b>",
        "emailData": {
            "subject": "Urgent Message from Head of State",
            "from": "<b>Head of Phillippines</b> &lt;head.of.philippines@gmail.com&gt;",
            "to": "Delegation of the Phillippines",
            "text": "Please send me an overview of all of your delegations members' intentions today, ASAP. We need to sync on strategies. Please also inform me of politically sensitive actions you are considering.<br /><br /> <b>In this excercise, click delete or reply to react to the email on the right.</b>"
        },
        "options": [{
            "text": "Delete",
            "correct": true,
            "header": "Great!",
            "feedback": "Good job noticing that 'Phillippines' was misspelled! You'd like to make sure that if you're talking to the Filipino head of state, that head of state could spell their country correctly in their email address..."
        }, {
            "text": "Reply",
            "correct": false,
            "header": "Uh oh!",
            "feedback": "You just got tricked by a subtle typo! Philippines, when correctly spelled, has one \"L\", while this address has two \"L\"s!"
        }]
    }, {
        "slideType": "text",
        "title": "Be wary of corporate account spoofs",
        "text": "The following example isn’t related to typos, but still highlights the importance of scrutinizing the email addresses of people asking you for sensitive information."
    }, {
        "slideType": "sketchyEmail",
        "name": "google-email",
        "text": "If you got an email from no-reply@accounts.google-email.com asking you to update personal profile information, would you trust it and click its embedded link to update your information?<br /><br /><b>In this excercise, click delete or \"Update Profile Information\" to react to the email on the right.</b>",
        "emailData": {
            "subject": "It's Time to Update Your Google Profile!",
            "from": "<b>Google Account Services</b> &lt;no-reply@accounts.google-email.com&gt;",
            "to": "me",
            "text": "It's been a while since you've last updated information about your Google Account. Please update your information through the following link."
        },
        "options": [{
            "text": "Delete",
            "correct": true,
            "header": "Good eye!",
            "feedback": "You avoided a phishing attempt! \"Google-mail\" is not \"gmail\" nor \"googlemail\", the two domains for Google’s email service."
        }, {
            "text": "Update Profile Information",
            "correct": false,
            "header": "Uh oh!",
            "feedback": "You just got phished. \"Google-mail\" is not \"gmail\" nor \"googlemail\", the two domains for google’s email service."
        }]
    }, {
        "slideType": "text",
        "title": "Be wary of corporate account spoofs",
        "text": "Spoofs of corporate accounts are often very realistic and difficult to detect. While casually glancing through your email, you may not be alarmed at the sight of \"Googlemail.\" However, it is still crucial to be extremely critical when an email account asks you for personal information; make sure to verify that those addresses actually correspond to email service names."
    }, {
        "slideType": "text",
        "title": "Introducing a new problem",
        "text": "Sometimes you’ll even get phishing emails from totally legitimate-looking email addresses! Phishers can spoof a legitimate-looking email address through the use of SMTP (simple mail transfer protocol) servers."
    }, {
        "slideType": "textImage",
        "title": "A solution?",
        "text": "Luckily, services like Gmail can snuff out emails that spoof real addresses. If you ever see this red banner, proceed very carefully (if at all)!",
        "imgSrc": "img/module-img/gmail-warning.png",
        "imgCitation": "https://www.linkedin.com/pulse/how-much-trust-do-you-put-your-gmail-inbox-messages-renato-marinho"
    }, {
        "slideType": "text",
        "text": "Knowing how to detect illegitimate or spoofed email addresses is a crucial first line of defense against phishing. Unfortunately, there are a plethora of other ways to phish people. Some of these approaches are more imperceptible than faked email addresses."
    }]
}, {
    "sectionName": "Scrutinizing Links",
    "slides": [{
        "slideType": "text",
        "text": "Phishing emails often include links to other websites that raise red flags. This section will introduce you to basic rules for rooting out suspicious links."
    }, {
        "slideType": "text",
        "title": ".com, .org, .gov, .edu are your friends!",
        "text": "Most legitimate websites end with the following patterns above; there are few people who sell domain names that end with these suffixes, and these vendors often try to verify the legitimacy of the person buying this domain."
    }, {
        "slideType": "text",
        "title": "Peek before you click!",
        "text": "Often, an easy way to tell if a link is legitimate before clicking on it is to hover your mouse above the link. As you do, a yellow box will appear at the bottom left corner and show a preview of the URL corresponding to that link. Try this with the button on the right! Sometimes, sketchy links are hidden behind realistic-looking buttons disguised as those belonging to official google emails, like those from Google Docs. If it looks obviously misleading (\"sketchywebsite.net\"), then don’t click it!"
    }, {
        "slideType": "fillInQuiz",
        "name": "examine-url",
        "text": "You can also right-click on a link in order to see if you can collect any information about it before actually clicking on it. This can help you identifiy suspicious links without accessing the potentially dangerous content that the links correspond to.<br /><br /> <b>In this excercise, try finding the URL this button links to.</b>",
        "buttonText": "Check this link out! Nothing suspicious here.",
        "answer": "https://www.wired.com/2015/08/how-to-use-facebook-privacy-settings-step-by-step/",
        "options": [{
            "text": "NONE",
            "correct": true,
            "header": "Good choice!",
            "feedback": "Congratulations! You successfully examined a link before clicking on it!"
        }, {
            "text": "NONE",
            "correct": false,
            "header": "Incorrect URL, try again!",
            "feedback": "Here's a hint: select \"Copy Link Address\" to copy the link and then paste it elsewhere to examine the full link.",
            "link": "https://www.wired.com/2015/08/how-to-use-facebook-privacy-settings-step-by-step/"
        }]
    }, {
        "slideType": "textImage",
        "title": "Link appearances can be deceiving...",
        "text": "However, suspicious links are not always obvious. For instance, they can be long links that look legitimate when truncated in a preview. The link on the right, when truncated, looks like <b>\"http://myaccount.google.com-securitysetting...\"</b> but is actually registered as a <b>\".tk\"</b> website (as opposed to the more conventional \".com\"). Any domain that is unfamiliar (and not .com, .org, .gov, .edu or .mil,) should trigger suspicion about a website and its authenticity.",
        "imgSrc": "img/module-img/tk-domain.jpg"
    }, {
        "slideType": "sketchyEmail",
        "name": "exposing-longer-urls",
        "title": "Exposing Longer URLs",
        "text": "Try examining the \"Check Your Grade\" button to the right before clicking it. Does its link look legitimate? <br /><br /><b>If you trust it, click the \"Check Grade\" button. Otherwise click the delete email button to safely dispose of this email.</b>",
        "emailData": {
            "subject": "Canvas: Assignment Graded",
            "from": "<b>Stanford Canvas</b> &lt;notifications@instructure.com&gt;",
            "to": "me",
            "text": "You have signed up to receive a daily report of some notifications from your Canvas account. Below is the report for May 24:<br /><br /> <b>Submission Comment: USERNAME_HERE, Problem Set 1, Introduction to Bioengineering (Engineering Living Matter, BIOE 80)</b><br /><br /> TA Gabbi Fisher just made a new comment on the submission for USERNAME_HERE for Problem Set 1."
        },
        "options": [{
            "text": "Delete",
            "correct": true,
            "header": "Good choice!",
            "feedback": "Congratulations! You successfully avoided clicking a sketchy link."
        }, {
            "text": "Check Your Grade Here",
            "correct": false,
            "header": "Uh oh!",
            "feedback": "This is an unsafe link! Double check the domain on this... you will see that it is actually .bs for Bahamas.",
            "link": "http://www.checkgrade.secure.actions.canvas.stanford.edu-html-stanford.bs/check_grade/class/bioengineering80/studentname.html"
        }]
    }, {
        "slideType": "text",
        "text": "Despite having stanford.edu in it, this link is illegitimate! Notice that it is not actually a .com website, but a convoluted URL for a .bs website.<br /><br />...<b>checkgrade.secure.actions.canvas.stanford.edu-html-stanford.bs</b>..."
    }, {
        "slideType": "text",
        "title": "Now, beware sketchy link shorteners...",
        "text": "Long and suspicious links like the one you just learned about can sometimes be obfuscated behind link shorteners, like bit.ly. These services allow long links to be represented in a short form."
    }, {
        "slideType": "textImage",
        "title": "Shortened links can be deceiving...",
        "text": "Now, look. the link on the right. It ends with a .com, so that test of legitimacy checks out.",
        "imgSrc": "img/module-img/shortened-link.jpg"
    }, {
        "slideType": "textImage",
        "title": "Shortened links can be deceiving...",
        "text": "What if we told you that innocent link, <b>http://bit.ly/2riL83e</b>, brought you to this sketchy link on the right we've already seen?",
        "imgSrc": "img/module-img/tk-domain.jpg"
    }, {
        "slideType": "textImage",
        "title": "Shortened links can be deceiving...",
        "text": "As you can see to the right, useful link-shortening services like bit.ly can be used to also hide malicious site links. Someone used bit.ly to represent <b>scammerwebsite.com</b> as <b>bit.ly/2s1eCme</b>.",
        "imgSrc": "img/module-img/bitly.jpg"
    }, {
        "slideType": "textImage",
        "title": "Examine shortened links!",
        "text": "Luckily, there are websites like <a href='http://wheredoesthislinkgo.com/'>wheredoesthislinkgo.com</a> that you can use to check what a shortened link actually leads to. For example, we can see that the shortened link <b>http://bit.ly/2k3rNkd</b> leads to <b>http://survey-winner.com/</b>, a website that could prey on people who think they really have won prizes through random online surveys.",
        "imgSrc": "img/module-img/example-expander.jpg"
    }, {
        "slideType": "fillInQuiz",
        "name": "examine-url",
        "text": "Now, try using <a href='http://wheredoesthislinkgo.com/'>wheredoesthislinkgo.com</a> to learn where the link to the right actually goes! Keep \"http\" in your answer.",
        "buttonText": "Check this link out! Nothing suspicious here.",
        "answer": "http://badwebsite.com/",
        "options": [{
            "text": "NONE",
            "correct": true,
            "header": "Good choice!",
            "feedback": "Congratulations! You thoroughly examined an obfuscated link before clicking on it!"
        }, {
            "text": "NONE",
            "correct": false,
            "header": "Incorrect URL, try again!",
            "feedback": "Here's a hint: select \"Copy Link Address\" to copy the link and then paste it to wheredoesthislinkgo.com to examine the full link.",
            "link": "http://bit.ly/1DCsMsx"
        }]
    }, {
        "slideType": "text",
        "text": "Another useful tool for evaluating the legitimacy of a URL is to see whether it starts with http or https. https represents a secure connection that encrypts the information that you share with a website. Trusted websites tend to use https."
    }, {
        "slideType": "quiz",
        "name": "bank-of-the-vvest",
        "text": "Do you trust this site?",
        "imgSrc": "img/module-img/bank-of-the-vvest.png",
        "imgCitation": "http://people.ischool.berkeley.edu/~hearst/papers/why_phishing_works.pdf",
        "options": [{
            "text": "Yes",
            "correct": false,
            "feedback": "This is actually bank of the v v est dot com! Be careful about reading URLs for authenticity before submitting information to them."
        }, {
            "text": "No",
            "correct": true,
            "feedback": "You noticed that the \"w\" in this website was actually two \"v\"s and avoided a sophisticated phishing attack. Congrats!"
        }]
    }, {
        "slideType": "text",
        "text": "While https usage can indicate a site's security and trustworthiness, online adversaries have begun to exploit https use to trick everyday internet users into trusting malicious sites. The next module will teach you to identify and avoid decieving https websites."
    }]
}, {
    "sectionName": "Examining URL Authenticity",
    "slides": [{
        "slideType": "textImage",
        "title": "Knowing when you are on an https connection",
        "text": "Google Chrome does an exceptionally good job of <u><a href=\"https://support.google.com/chrome/answer/95617\"></u>showing you when you are on a secure https connection</a>. Take a look at your URL bar: if there is a green lock saying that you have a \"Secure\" connection, you’re on https! If you see a red cross or grey \"i\", then you are on an insecure connection and should be careful about sharing your personal information.",
        "imgSrc": "img/module-img/chrome-https.png",
        "imgCitation": "https://support.google.com/chrome/answer/95617"
    }, {
        "slideType": "textImage",
        "title": "Intro to certs",
        "text": "TODO: https websites use certificates to demonstrate a website’s identity; when sharing data with a website, certificates help prove that you are communicating with the party you expect. (In this case: the actual twitter.com as opposed to an attacker impersonating twitter.com)",
        "imgSrc": "img/module-img/twitter-cert.png",
        "imgCitation": "https://twitter.com"
    }, {
        "slideType": "text",
        "text": "Certificates are a crucial part of https and are worth examining. More and more websites are beginning to use certificatess to establish secure https connections by default. Projects like <u><a href=\"https://letsencrypt.org/\">Let’s Encrypt</a></u> issue certificates to any legitimate-seeming website in an attempt to encourage more people to use secure connections by default."
    }, {
        "slideType": "text",
        "text": "Unfortunately, phishers use this service to issue certificates to deceiving websites. In fact, their use of certificates makes their sites look extremely trustworthy! In March 2017, <u><a href=\"https://www.thesslstore.com/blog/lets-encrypt-phishing/\">security researchers found that Let’s Encrypt issued 14,000 certificates to PayPal phishing sites</a></u>. Even if a website looks legitimate and has a certificate, check that its URL is also legitimate!"
    }, {
        "slideType": "quiz",
        "name": "shopping.paypal",
        "text": "Do you trust the following website? (Assume it has a valid certificate: i.e. green lock) <h3>https://shopping.paypal.com/index</h3>",
        "options": [{
            "text": "Yes",
            "correct": true,
            "feedback": "Correct! This is a real PayPal domain."
        }, {
            "text": "No",
            "correct": false,
            "feedback": "It’s good to be cautious, but this is probably okay: a URL like \"shopping.paypal.com\" should be under the control of the same people who run \"paypal.com\""
        }]
    }, {
        "slideType": "quiz",
        "name": "secure-alert",
        "text": "Do you trust the following site? (Assume it has a valid certificate: i.e. green lock) <h3>https://paypal.com.secure-alert.net</h3>",
        "options": [{
            "text": "Yes",
            "correct": false,
            "feedback": "You just trusted a phishing site. Yes, it has a certificate and https connection, but, in this case, these are tools that are used to make a misleading URL more convincing. When looking for suspicious URLs, remember that it doesn’t matter if .com shows up somewhere in a URL. What matters is how the URL ends (before any slashes): this one actually belongs to \"secure-alert\".net"
        }, {
            "text": "No",
            "correct": true,
            "feedback": "You avoided a sophisticated phishing attack. Congrats!"
        }]
    }, {
        "slideType": "text",
        "text": "Knowing when you are on a https connection can help you identify whether you are communicating with a trustworthy website or not. Even then, adversaries can use https to trick you into a false sense of security. Be careful!"
    }]
}, {
    "sectionName": "Final Simulation",
    "slides": [{
        "slideType": "text",
        "text": "Now, let's put your skills to the test."
    }, {
        "slideType": "text",
        "text": "It's 2016. You're a chairman of a high-profile American presidential campaign. Your name is Jon Podesta. Your personal email address--which you also are using for some campaign work--is <b>john.podesta@gmail.com</b>."
    }, {
        "slideType": "text",
        "text": "You’ll be working your way through a scenario in Jon’s inbox. If an email is reasonable, you can <b>click the link included in the email</b>. If you think you’re being phished, you can <b>delete the email</b> at any time."
    }, {
        "slideType": "text",
        "text": "Now, step into Jon Podesta's shoes. It's another typical morning, and you've got to catch up on your inbox."
    }, {
        "slideType": "text",
        "text": "In this simlation, you will not recieve immediate feedback after performing an action on an email. <b>At the end, you will learn if you fell for a phishing attempt or not.</b>"
    }, {
        "slideType": "inboxSimulation"
    }, {
        "slideType": "completion"
    }]
}]
